app/controllers/home_controller.rb

SELECT "uploads".* FROM "uploads" WHERE "uploads"."bodypart" = $1  [["bodypart", "body"]]
---
  def index

    # @uploads = Upload.all
    @bodies = Upload.where(bodypart: 'body')