app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads" ORDER BY created_at DESC
---
  def index
    @uploads = Upload.order('created_at DESC')

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "uploads" WHERE "uploads"."id" = $1  [["id", 9]]
---
  def destroy
    @upload = Upload.find(params[:id])
    if @upload.destroy

INSERT INTO "uploads" ("image", "created_at", "updated_at", "bodypart") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "unipurpgo.png"], ["created_at", "2018-09-05 13:46:02.483555"], ["updated_at", "2018-09-05 13:46:02.483555"], ["bodypart", "body"]]
---
  def create
    @upload = Upload.new(upload_params)
    if @upload.save

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_upload
    @upload = Upload.find(params[:id])